In [2]:
import numpy as np, pandas as pd

### Series

In [8]:
data = {'a':1,'b':2,'c':3}
s = pd.Series(data = data)
s

a    1
b    2
c    3
dtype: int64

In [11]:
s.index = ['x','y','z']
s

x    1
y    2
z    3
dtype: int64

In [63]:
a = np.array([9,8,7,6,7,7,6,8,9,6])
s2 = pd.Series(a,index = [0,1,2,3,2,2,3,1,0,3])
s2

0    9
1    8
2    7
3    6
2    7
2    7
3    6
1    8
0    9
3    6
dtype: int64

In [298]:
s2.argsort()

0    3
1    6
2    9
3    4
2    5
2    2
3    7
1    1
0    0
3    8
dtype: int64

In [68]:
g = s2.groupby(level=0)
g.size()

0    2
1    2
2    3
3    3
dtype: int64

In [246]:
g = s2.groupby(s2)
g.size()

6    3
7    3
8    2
9    2
dtype: int64

In [90]:
s2.value_counts()

6    3
7    3
8    2
9    2
Name: count, dtype: int64

In [146]:
s3 = pd.Series(range(10))

In [147]:
s3.where(s3 > 5, 10 - s3)

0    10
1     9
2     8
3     7
4     6
5     5
6     6
7     7
8     8
9     9
dtype: int64

In [151]:
s3.truncate(4)

4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [150]:
s3.transform(lambda x : x**2)

0     0
1     1
2     4
3     9
4    16
5    25
6    36
7    49
8    64
9    81
dtype: int64

In [154]:
s3.sort_values(ascending=False,ignore_index=True)

0    9
1    8
2    7
3    6
4    5
5    4
6    3
7    2
8    1
9    0
dtype: int64

In [224]:
s4 = pd.Series(np.random.randint(1,7,(1000)))

In [257]:
s4.value_counts()

1    177
5    176
6    169
2    162
4    159
3    157
Name: count, dtype: int64

In [269]:
s4.groupby(lambda x : "Even" if x%2==0 else "Odd").count()

Even    500
Odd     500
dtype: int64

In [281]:
s4.duplicated().value_counts()

True     994
False      6
Name: count, dtype: int64

In [195]:
s5 = pd.Series(np.random.random(100))

In [282]:
s5.count(),s5.mean(),s5.max(),s5.min(),s5.sum(),s5.median(),s5.mode()[0],s5.std(),s5.var()

(np.int64(100),
 np.float64(0.4877642545630909),
 np.float64(0.9939182144024845),
 np.float64(0.0016646216833395844),
 np.float64(48.77642545630909),
 np.float64(0.46369477026408135),
 np.float64(0.0016646216833395844),
 np.float64(0.3110945979176417),
 np.float64(0.09677984885353916))

In [206]:
s5.describe()

count    100.000000
mean       0.487764
std        0.311095
min        0.001665
25%        0.199054
50%        0.463695
75%        0.781815
max        0.993918
dtype: float64

In [293]:
s5.argmax(),s5.argmin()

(np.int64(62), np.int64(39))

### DataFrame

In [348]:
df = pd.DataFrame([('Jeevan',51,99),('Aravind',12,98),('Sukumar',49,99)])
df.columns = ['Name','ID','Percentage']
df.index = range(1, df.shape[0] + 1)
df = df.add_prefix('Student_',axis=0)
df = df.add_prefix('Student_',axis=1)
df

          Student_Name  Student_ID  Student_Percentage
Student_1       Jeevan          51                  99
Student_2      Aravind          12                  98
Student_3      Sukumar          49                  99

In [358]:
df.at['Student_1','Student_Name'],df.iat[2,2]

('Jeevan', np.int64(99))

In [371]:
df.loc['Student_4'] = ['kalyan',11,100]
df.loc['Student_5'] = ['Lavan',60,99]

In [377]:
df.iloc[3:,[0,2]]

          Student_Name  Student_Percentage
Student_4       kalyan                 100
Student_5        Lavan                  99

In [380]:
df[df.loc[:,'Student_Percentage']==100]

          Student_Name  Student_ID  Student_Percentage
Student_4       kalyan          11                 100

In [393]:
df.where(df['Student_Percentage'] == 100, '--')[['Student_Name','Student_Percentage']]

          Student_Name Student_Percentage
Student_1           --                 --
Student_2           --                 --
Student_3           --                 --
Student_4       kalyan                100
Student_5           --                 --

In [404]:
df1 = pd.DataFrame(np.pad(np.resize(np.arange(10),(3,3)),((3, 2), (2, 3)),'maximum'),columns=[1,2,3,4,5,6,7,8])
df1

   1  2  3  4  5  6  7  8
0  8  8  6  7  8  8  8  8
1  8  8  6  7  8  8  8  8
2  8  8  6  7  8  8  8  8
3  2  2  0  1  2  2  2  2
4  5  5  3  4  5  5  5  5
5  8  8  6  7  8  8  8  8
6  8  8  6  7  8  8  8  8
7  8  8  6  7  8  8  8  8

In [410]:
df1.groupby(by=2).count()

   1  3  4  5  6  7  8
2
2  1  1  1  1  1  1  1
5  1  1  1  1  1  1  1
8  6  6  6  6  6  6  6

In [427]:
df1.agg(['max','min','sum','mean','std','var','median'])

,1,2,3,4,5,6,7,8
max,8.000000,8.000000,6.000000,7.000000,8.000000,8.000000,8.000000,8.000000
min,2.000000,2.000000,0.000000,1.000000,2.000000,2.000000,2.000000,2.000000
sum,55.000000,55.000000,39.000000,47.000000,55.000000,55.000000,55.000000,55.000000
mean,6.875000,6.875000,4.875000,5.875000,6.875000,6.875000,6.875000,6.875000
std,2.232071,2.232071,2.232071,2.232071,2.232071,2.232071,2.232071,2.232071
var,4.982143,4.982143,4.982143,4.982143,4.982143,4.982143,4.982143,4.982143
median,8.000000,8.000000,6.000000,7.000000,8.000000,8.000000,8.000000,8.000000

In [431]:
df1.cumsum()

    1   2   3   4   5   6   7   8
0   8   8   6   7   8   8   8   8
1  16  16  12  14  16  16  16  16
2  24  24  18  21  24  24  24  24
3  26  26  18  22  26  26  26  26
4  31  31  21  26  31  31  31  31
5  39  39  27  33  39  39  39  39
6  47  47  33  40  47  47  47  47
7  55  55  39  47  55  55  55  55

In [441]:
df1.duplicated().count()

np.int64(8)

In [445]:
df1.drop_duplicates(inplace=True)
df1

   1  2  3  4  5  6  7  8
0  8  8  6  7  8  8  8  8
3  2  2  0  1  2  2  2  2
4  5  5  3  4  5  5  5  5